# PDF_SetProgressBar

## Description
Sets the progress bar from the PDF Import Menu Command

```pascal
FUNCTION PDF_SetProgressBar(
				progressPtr : PROCEDURE;
				status      : BOOLEAN): BOOLEAN;
```

```python
def vs.PDF_SetProgressBar(progressPtr, status):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|progressPtr|PROCEDURE|   |
|status|BOOLEAN|   |

## Version
Availability: from Vectorworks 2014

## Category
* PDF